app/Http/Controllers/front/AuthController.php

    public function registerUser(UserRegisterRequest $request) {
        try {
            $user = new User();
            $user->email = $request->email;
            $user->password = Hash::make($request->password);
            $user->fk_role_id = 4;
            $user->save();

            $patient = new Patient();
            $patient->first_name = $request->first_name;
            $patient->last_name = $request->last_name;
            $patient->phone = $request->phone;
            $patient->email = $request->email;
            $patient->fk_user_id = $user->user_id;
            $patient->save();
---
insert into `users` (`email`, `password`, `fk_role_id`, `updated_at`, `created_at`) values ('support@pepdev.com', '$2y$12$QCOVqcpQg0ssfyw3QHzFYeAHxUY.V.jSxHcoDz5.xkSfzgncaCIDO', 4, '2026-02-06 09:58:45', '2026-02-06 09:58:45')
insert into `patients` (`first_name`, `last_name`, `phone`, `email`, `fk_user_id`, `updated_at`, `created_at`) values ('Богдан', 'вујновић', '321321321', 'support@pepdev.com', 253, '2026-02-06 09:58:45', '2026-02-06 09:58:45')

    public function loginUser(UserLoginRequest $request) {
        $email = $request->email;
        $password = $request->password;

        $user = User::where('email', $email)->first();
---
select * from `users` where `email` = 'test.user@gmail.com' and `users`.`deleted_at` is null limit 1