app/Http/Controllers/front/FrontController.php

    function homeIndex() {
        $dentists = Dentist::all()->sortBy('order')->take(4);
---
select * from `dentists` where `dentists`.`deleted_at` is null

    function appointmentIndex() {
        if(Auth::check()) {
            $appointmentHours = Hour::where('is_available_for_booking', 1)->get();
            $dentists = Dentist::all()->sortBy('order');
            $services = Service::where('is_able_for_reservation', 1)->orderBy('name')->get();
---
select * from `hours` where `is_available_for_booking` = 1
select * from `dentists` where `dentists`.`deleted_at` is null
select * from `services` where `is_able_for_reservation` = 1 and `services`.`deleted_at` is null order by `name` asc