app/Filament/Resources/Users/Schemas/UserForm.php

select `name`, `role_id` from `roles` where `role_id` > 1
---
    public static function configure(Schema $schema): Schema
    {
        return $schema
            ->components([
                TextInput::make('email')
                    ->label('Email address')
                    ->email()
                    ->required(),
                TextInput::make('password')
                    ->password()
                    ->required(),
                Select::make('fk_role_id')
                    ->label('Role')
                    ->relationship('role', 'name')
                    ->options(function(callable $get) {
                        $roles = Role::where('role_id', '>', 1)
                            ->pluck('name', 'role_id')
                            ->toArray();